tap "homebrew/bundle"
tap "homebrew/cask", "https://mirrors.ustc.edu.cn/homebrew-cask.git"
tap "homebrew/cask-fonts"
tap "homebrew/core", "git://mirrors.ustc.edu.cn/homebrew-core.git"
tap "homebrew/services"
tap "jandedobbeleer/oh-my-posh"
tap "mas-cli/tap"
# Platform built on V8 to build network applications
brew "node"
# Secure and free password manager for all of your devices
brew "bitwarden-cli"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Core application library for C
brew "glib"
# Cross-platform make
brew "cmake"
# Utility that creates projects from templates
brew "cookiecutter"
# Load/unload environment variables based on $PWD
brew "direnv"
# International domain name library (IDNA2008, Punycode and TR46)
brew "libidn2"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# OpenType text shaping engine
brew "harfbuzz"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Extensions to follow Vincent Driessen's branching model
brew "git-flow"
# MP3 player for Linux and UNIX
brew "mpg123"
# HTTP/2 C Library
brew "nghttp2"
# Python dependency management tool
brew "pipenv"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Object-relational database system
brew "postgresql@10", restart_service: true
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Ruby version manager
brew "rbenv"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# General-purpose lossless data-compression library
brew "zlib"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Cloud storage service
cask "baidunetdisk"
# Desktop password and login vault
cask "bitwarden"
# API documentation browser and code snippet manager
cask "dash"
# Browser for SQLite databases
cask "db-browser-for-sqlite"
# App for note taking, organizing, task lists, and archiving
cask "evernote"
# Web browser
cask "firefox"
cask "font-fira-code"
cask "font-hack"
# Desktop client for GitHub repositories
cask "github"
# Terminal built on web technologies
cask "hyper"
# Free and open-source media player
cask "iina"
# Keyboard customizer
cask "karabiner-elements"
# File archiver
cask "keka"
# Music streaming platform
cask "neteasemusic"
# IDE for Python programming - Community Edition
cask "pycharm-ce"
# Instant messaging application focusing on security
cask "signal"
# To-do & task list manager
cask "ticktick"
# Open-source code editor
cask "visual-studio-code"
# Free messaging and calling application
cask "wechat"
